;-----------------------------------------------
; ABILITIES - MW CHANGE - ADD PROMOTION POPUP
;-----------------------------------------------

[RoboticChassis X2AbilityTemplate]
LocFriendlyName="Механическая единица"
LocLongDescription="Этот юнит невосприимчив к огню и отравлению, а также, предоставляет высокое укрытие для союзников.\nНе может стать целью контроля над разумом или других подобных пси-способностей."
LocHelpText="Этот юнит невосприимчив к огню и отравлению, а также, предоставляет высокое укрытие для союзников.\nНе может стать целью контроля над разумом или других подобных пси-способностей."
LocPromotionPopupText="Этот юнит невосприимчив к огню и отравлению, а также, предоставляет высокое укрытие для союзников.\nНе может стать целью контроля над разумом или других подобных пси-способностей."

;-----------------------
; TECHS - BAYS
;-----------------------

[ExpandRepairBay X2TechTemplate]
DisplayName="Расширить ремонтный отсек I"
Summary="Исследовав метод строения МЭКа \"Адвента\" и переместив некоторое оборудование в складские помещения, мы можем добавить еще один отсек для обслуживания механических единиц, в наш инженерно-технический отдел.\n\nЭто позволит ремонтировать больше механических единиц и \"Искр\" одновременно и увеличить скорость мы можем выполнять ремонт"

[ExpandRepairBay2 X2TechTemplate]
;DisplayName="Расширить ремонтный отсек - снова"
DisplayName="Расширить ремонтный отсек II"
Summary="Исследовав метод строения МЭКа \"Адвента\" и переместив некоторое оборудование в складские помещения, мы можем добавить еще один отсек для обслуживания механических единиц, в наш инженерно-технический отдел.\n\nЭто позволит ремонтировать больше механических единиц и \"Искр\" одновременно и увеличить скорость мы можем выполнять ремонт"

[ExpandRepairBay3 X2TechTemplate]
;DisplayName="Расширить ремонтный отсек - в последний раз"
DisplayName="Расширить ремонтный отсек III"
Summary="Исследовав метод строения МЭКа \"Адвента\" и переместив некоторое оборудование в складские помещения, мы можем добавить еще один отсек для обслуживания механических единиц, в наш инженерно-технический отдел.\n\nЭто позволит ремонтировать больше механических единиц и \"Искр\" одновременно и увеличить скорость мы можем выполнять ремонт"

[ExpandRepairBay4 X2TechTemplate]
;DisplayName="Расширить ремонтный отсек - вы могли бы разместить там боевого робота"
DisplayName="Расширить ремонтный отсек IV"
Summary="Исследовав метод строения МЭКа \"Адвента\" и переместив некоторое оборудование в складские помещения, мы можем добавить еще один отсек для обслуживания механических единиц, в наш инженерно-технический отдел.\n\nЭто позволит ремонтировать больше механических единиц и \"Искр\" одновременно и увеличить скорость мы можем выполнять ремонт"

;-----------------------
; TECHS - CREATION
;-----------------------

[BuildSpark X2TechTemplate]
DisplayName="Построить \"Искру\" - создать новую единицу"
Summary="Создайте боевую механическую единицу \"Искра\", с новой личностной матрицей и стандартными боевыми данными.\nНаши \"Искры\" обладают преимуществом перед биологическими бойцами: при получении ими критического урона \"Искра\" не уничтожается полностью. Ядро данных может быть восстановлено, а шасси перестроено.\n\"Искры\" не занимают жилых помещений на \"Мстителе\" и ремонтируются в инженерном блоке."

[BuildExpSpark X2TechTemplate]
DisplayName="Построить \"Искру\" - создать расширенный модуль"
Summary="Создайте боевую механическую единицу \"Искра\", с новой личностной матрицей и расширенными боевыми данными.\nНаши \"Искры\" обладают преимуществом перед биологическими бойцами: при получении ими критического урона \"Искра\" не уничтожается полностью. Ядро данных может быть восстановлено, а шасси перестроено.\n\"Искры\" не занимают жилых помещений на \"Мстителе\" и ремонтируются в инженерном блоке."

[RebuildSpark X2TechTemplate]
DisplayName="Построить \"Искру\" - восстановление ядра"
Summary="Создайте боевую механическую единицу \"Искра\", с использованием ядра памяти. Новая единица будет иметь тот-же опыт и звание, что и его предшественник.\nОднако \"Искре\" может потребоваться полевой опыт, для калибровки старого программного обеспечения и нового оборудования."

[RM_ConvertMEC X2TechTemplate]
DisplayName="Построить \"Искру\" - восстановление из останков МЭК"
Summary="Разработанный покойным Др. Р. Шень перед первым вторжением около 20 лет назад прототип \"Искры\", послужил прообразом всех будущих проектов МЭК \"Адвента\".\nМы можем использовать это против \"Адвента\": при наличии достаточного количества обломков МЭК \"Адвента\", мы можем сделать \"Искру\" из компонентов, а с некоторыми дополнительными расходными материалами можем установить новое ядро памяти."

[RM_SparkSergeantTech X2TechTemplate]
DisplayName="Продвинутая кодировка \"Искры\""
Summary="Теперь когда у нас есть опытные солдаты, и опыт столкновений с МЭК \"Адвента\", мы имеем возможность создать расширенную базу данных для наших \"Искр\", используя боевой опыт предыдущих миссий. Это позволит создать \"Искру\", которая изначально будет иметь боевой опыт."

;-----------------------
; ITEMS - TECH
;-----------------------

[Rusty_RecoverCores X2TechTemplate]
DisplayName="Восстановление ядра \"Искры\""
Summary="Мы получили сигнал из ядра памяти \"Искры\", который был уничтожен в бою поблизости. Мы можем подобрать его. Если удастся вернуть ядро, мы сможем использовать его для восстановления разрушенной \"Искры\"."

[CorpseSPARK X2ItemTemplate]
FriendlyName="<font color='#E67A0E'>Ядро памяти \"Искры\"</font>"
FriendlyNamePlural="<font color='#E67A0E'>Ядра памяти \"Искры\"</font>"
BriefSummary="Ядро памяти павшего в бою \"Искры\", принадлежащей XCOM. Оно было отправлено на \"Мститель\", когда \"Искра\" был уничтожен. При аварийном выбросе, ядро было повреждено. Его можно использовать при создании новой \"Искры\" в зоне испытаний, для восстановления характеристик и боевых способностей." 

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: ПОСТРОЙТЕ РОБОТА"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="ВАКАНСИЯ: ТРЕБУЕТСЯ РОБОТ"
BonusEmptyText="Начать ремонт РОБОТА."
BonusText="РЕМОНТ РОБОТА"
FilledText="%UNITNAME ремонтируется!"
LockedText="НЕДОСТУПНО: РАСШИРЬТЕ ОТСЕК"
